ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/pic32cx2038mtc100_0.h
/* ---------------------------------------------------------------------------- */
/*                Microchip Microcontroller Software Support                    */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) %copyright_year%, Microchip Technology Inc.                    */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Microchip's name may not be used to endorse or promote products derived from */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS  */
/* OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES */
/* OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT    */
/* ARE DISCLAIMED. IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT,        */
/* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           */
/* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; */
/* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND  */
/* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   */
/* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF     */
/* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.            */
/* ---------------------------------------------------------------------------- */

#ifndef _PIC32CX2038MTC100_
#define _PIC32CX2038MTC100_

/** \addtogroup PIC32CX2038MTC100_definitions PIC32CX2038MTC100 definitions
  This file defines all structures and symbols for PIC32CX2038MTC100:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR PIC32CX2038MTC100 */
/* ************************************************************************** */
/** \addtogroup PIC32CX2038MTC100_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  HardFault_IRQn        = -13, /**<  3 HardFault Interrupt                   */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M4 System Tick Interrupt       */
/******  PIC32CX2038MTC100 specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 Real Time Timer (RTT) */
  DWDT_IRQn            =  4, /**<  4 Dual Watchdog Timer (DWDT) */
  PMC_IRQn             =  6, /**<  6 Power Management Controller (PMC) */
  SEFC0_IRQn           =  7, /**<  7 Embedded Flash Controller 0 (SEFC0) */
  SEFC1_IRQn           =  8, /**<  8 Embedded Flash Controller 1 (SEFC1) */
  FLEXCOM0_IRQn        =  9, /**<  9 FLEXCOM 0 (USART0/SPI0/TWI0) (FLEXCOM0) */
  FLEXCOM1_IRQn        = 10, /**< 10 FLEXCOM 1 (USART1/SPI1/TWI1) (FLEXCOM1) */
  FLEXCOM2_IRQn        = 11, /**< 11 FLEXCOM 2 (USART2/SPI2/TWI2) (FLEXCOM2) */
  FLEXCOM3_IRQn        = 12, /**< 12 FLEXCOM 3 (USART3/SPI3/TWI3) (FLEXCOM3) */
  FLEXCOM4_IRQn        = 13, /**< 13 FLEXCOM 4 (USART4/SPI4/TWI4) (FLEXCOM4) */
  FLEXCOM5_IRQn        = 14, /**< 14 FLEXCOM 5 (USART5/SPI5/TWI5) (FLEXCOM5) */
  FLEXCOM6_IRQn        = 15, /**< 15 FLEXCOM 6 (USART6/SPI6/TWI6) (FLEXCOM6) */
  FLEXCOM7_IRQn        = 16, /**< 16 FLEXCOM 7 (USART7/SPI7/TWI7) (FLEXCOM7) */
  PIOA_IRQn            = 17, /**< 17 Application Core Parallel I/O Controller A (PIOA) (PIOA) */
  PIOA_SEC_IRQn        = 18, /**< 18 Application Core Parallel I/O Controller A (PIOA) Secure Event Interrupt (PIOA_SEC) */
  PIOB_IRQn            = 19, /**< 19 Application Core Parallel I/O Controller (B PIOB) (PIOB) */
  PIOB_SEC_IRQn        = 20, /**< 20 Application Core Parallel I/O Controller (B PIOB) Secure Event Interrupt (PIOB_SEC) */
  PIOC_IRQn            = 21, /**< 21 Application Core Parallel I/O Controller C (PIOC) (PIOC) */
  PIOC_SEC_IRQn        = 22, /**< 22 Application Core Parallel I/O Controller C (PIOC) Secure Event Interrupt (PIOC_SEC) */
  QSPI_IRQn            = 23, /**< 23 Quad IO Serial Peripheral Interface (QSPI) */
  ADC_IRQn             = 24, /**< 24 Analog To Digital Converter (ADC) */
  ACC_IRQn             = 25, /**< 25 Analog Comparator (ACC) */
  ARM0_FPU_IRQn        = 26, /**< 26 Application Core (CORE0) Floating Point Unit except IXC (ARM0_FPU) */
  ARM0_IXC_IRQn        = 27, /**< 27 Application Core (CORE0) FPU Interrupt IXC associated with FPU cumulative exception bit (ARM0_IXC) */
  IPC0_IRQn            = 28, /**< 28 Application Core Interprocessor communication (IPC0) (IPC0) */
  SLCDC_IRQn           = 29, /**< 29 Segment LCD Controller (SLCDC) */
  MEM2MEM0_IRQn        = 30, /**< 30 Application Core Memory to Memory Transfer Controller (MEM2MEM0) (MEM2MEM0) */
  TC0_CHANNEL0_IRQn    = 31, /**< 31 Timer Counter 0, Channel 0 (TC0_CHANNEL0) */
  TC0_CHANNEL1_IRQn    = 32, /**< 32 Timer Counter 0, Channel 1 (TC0_CHANNEL1) */
  TC0_CHANNEL2_IRQn    = 33, /**< 33 Timer Counter 0, Channel 2 (TC0_CHANNEL2) */
  TC1_CHANNEL0_IRQn    = 34, /**< 34 Timer Counter 1, Channel 0 (TC1_CHANNEL0) */
  TC1_CHANNEL1_IRQn    = 35, /**< 35 Timer Counter 1, Channel 1 (TC1_CHANNEL1) */
  TC1_CHANNEL2_IRQn    = 36, /**< 36 Timer Counter 1, Channel 2 (TC1_CHANNEL2) */
  TC2_CHANNEL0_IRQn    = 37, /**< 37 Timer Counter 2, Channel 0 (TC2_CHANNEL0) */
  TC2_CHANNEL1_IRQn    = 38, /**< 38 Timer Counter 2, Channel 1 (TC2_CHANNEL1) */
  TC2_CHANNEL2_IRQn    = 39, /**< 39 Timer Counter 2, Channel 2 (TC2_CHANNEL2) */
  TC0_C0SEC_IRQn       = 40, /**< 40 Timer Counter 0, Channel 0, Secure IRQ (TC0_C0SEC) */
  TC0_C1SEC_IRQn       = 41, /**< 41 Timer Counter 0, Channel 1, Secure IRQ (TC0_C1SEC) */
  TC0_C2SEC_IRQn       = 42, /**< 42 Timer Counter 0, Channel 2, Secure IRQ (TC0_C2SEC) */
  TC1_C0SEC_IRQn       = 43, /**< 43 Timer Counter 1, Channel 0, Secure IRQ (TC1_C0SEC) */
  TC1_C1SEC_IRQn       = 44, /**< 44 Timer Counter 1, Channel 1, Secure IRQ (TC1_C1SEC) */
  TC1_C2SEC_IRQn       = 45, /**< 45 Timer Counter 1, Channel 2, Secure IRQ (TC1_C2SEC) */
  TC2_C0SEC_IRQn       = 46, /**< 46 Timer Counter 2, Channel 0, Secure IRQ (TC2_C0SEC) */
  TC2_C1SEC_IRQn       = 47, /**< 47 Timer Counter 2, Channel 1, Secure IRQ (TC2_C1SEC) */
  TC2_C2SEC_IRQn       = 48, /**< 48 Timer Counter 2, Channel 2, Secure IRQ (TC2_C2SEC) */
  AES_IRQn             = 49, /**< 49 Advanced Enhanced Standard (AES) */
  AES_AESSEC_IRQn      = 50, /**< 50 AES Secure Event Interrupt (AES_AESSEC) */
  AESB_IRQn            = 51, /**< 51 AES Bridge (AESB) */
  AESB_AESBSEC_IRQn    = 52, /**< 52 AES Bridge Secure Interrupt (AESB_AESBSEC) */
  SHA_IRQn             = 53, /**< 53 Secure Hash Algorithm (SHA) */
  SHA_SHASEC_IRQn      = 54, /**< 54 SHA Secure Event Interrupt (SHA_SHASEC) */
  TRNG_IRQn            = 55, /**< 55 True Random Generator (TRNG) */
  TRNG_TRNGSEC_IRQn    = 56, /**< 56 TRNG Secure Event Interrupt (TRNG_TRNGSEC) */
  ICM_IRQn             = 57, /**< 57 Integrity Check Module (ICM) */
  ICM_ICMSEC_IRQn      = 58, /**< 58 Integrity Check Module (ICM_ICMSEC) */
  CPKCC_IRQn           = 59, /**< 59 Public Key Cryptography Controller (CPKCC) */
  MATRIX0_IRQn         = 60, /**< 60 High-Speed Application Core Matrix (HSACM) (MATRIX0) (MATRIX0) */
  MATRIX1_IRQn         = 61, /**< 61 Low-Speed Application Core Matrix (LSACM) (MATRIX1) (MATRIX1) */
  SUPC_WKUP3_IRQn      = 62, /**< 62 External interrupt 3 (SUPC_WKUP3) */
  SUPC_WKUP4_IRQn      = 63, /**< 63 External interrupt 4 (SUPC_WKUP4) */
  SUPC_WKUP5_IRQn      = 64, /**< 64 External interrupt 5 (SUPC_WKUP5) */
  SUPC_WKUP6_IRQn      = 65, /**< 65 External interrupt 6 (SUPC_WKUP6) */
  SUPC_WKUP7_IRQn      = 66, /**< 66 External interrupt 7 (SUPC_WKUP7) */
  SUPC_WKUP8_IRQn      = 67, /**< 67 External interrupt 8 (SUPC_WKUP8) */
  SUPC_WKUP9_IRQn      = 68, /**< 68 External interrupt 9 (SUPC_WKUP9) */
  SUPC_WKUP10_IRQn     = 69, /**< 69 External interrupt 10 (SUPC_WKUP10) */
  SUPC_WKUP11_IRQn     = 70, /**< 70 External interrupt 11 (SUPC_WKUP11) */
  SUPC_WKUP12_IRQn     = 71, /**< 71 External interrupt 12 (SUPC_WKUP12) */
  SUPC_WKUP13_IRQn     = 72, /**< 72 External interrupt 13 (SUPC_WKUP13) */
  SUPC_WKUP14_IRQn     = 73, /**< 73 External interrupt 14 (SUPC_WKUP14) */
  SUPC_WKUP15_IRQn     = 74, /**< 74 External interrupt 15 (SUPC_WKUP15) */
  SEAFEC_SLINK_IRQn    = 76, /**< 76 Smart Energy Analog Front-End Controller Serial Link Interrupt (SEAFEC_SLINK) */
  SEAFEC_DATA_IRQn     = 77, /**< 77 Smart Energy Analog Front-End Controller Data Ready Interrupt (SEAFEC_DATA) */
  MEM2MEM1_IRQn        = 78, /**< 78 Metrology Core Memory to Memory Transfer Controller 1 (MEM2MEM1) (MEM2MEM1) */
  TC3_CHANNEL0_IRQn    = 79, /**< 79 Timer Counter 3, Channel 0 (TC3_CHANNEL0) */
  TC3_CHANNEL1_IRQn    = 80, /**< 80 Timer Counter 3, Channel 1 (TC3_CHANNEL1) */
  TC3_CHANNEL2_IRQn    = 81, /**< 81 Timer Counter 3, Channel 2 (TC3_CHANNEL2) */
  TC3_C0SEC_IRQn       = 82, /**< 82 Timer Counter 3, Channel 0, Secure IRQ (TC3_C0SEC) */
  TC3_C1SEC_IRQn       = 83, /**< 83 Timer Counter 3, Channel 1, Secure IRQ (TC3_C1SEC) */
  TC3_C2SEC_IRQn       = 84, /**< 84 Timer Counter 3, Channel 2, Secure IRQ (TC3_C2SEC) */
  PIOD_IRQn            = 85, /**< 85 Metrology Core Parallel I/O Controller D (PIOD) (PIOD) */
  PIOD_SEC_IRQn        = 86, /**< 86 Metrology Core Parallel I/O Controller A Secure Interupt (named as PIOD) (PIOD_SEC) */
  UART_IRQn            = 87, /**< 87 Optical UART (UART) */
  IPC1_IRQn            = 88, /**< 88 Metrology Core Interprocessor communication (IPC1) (IPC1) */
  MCSPI_IRQn           = 89, /**< 89 Multi-Channel SPI (MCSPI) */
  PWM_IRQn             = 90, /**< 90 Pulse Width Modulation (PWM) */
  ARM1_FPU_IRQn        = 92, /**< 92 Metrology Core (CORE1) Floating Point Unit except IXC (ARM1_FPU) */
  ARM1_IXC_IRQn        = 93, /**< 93 Metrology Core (CORE1) FPU Interrupt IXC associated with FPU cumulative exception bit (ARM1_IXC) */
  MATRIX2_IRQn         = 94, /**< 94 High-Speed Metrology Core Matrix (HSMCM) (Formely MATRIX2) (MATRIX2) */
  MATRIX3_IRQn         = 95, /**< 95 Low-Speed Metrology Core Matrix (LSMCM) (Formely MATRIX3) (MATRIX3) */

  PERIPH_COUNT_IRQn    = 97  /**< Number of peripheral IDs */
} IRQn_Type;

