ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/pic32cx2038mtc100_0.h
#include "pio/pic32cx2038mtc100.h"
/*@}*/

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CX2038MTC100 */
/* ************************************************************************** */

#define IFLASH0_SIZE             (0x100000u)
#define IFLASH0_PAGE_SIZE        (512u)
#define IFLASH0_LOCK_REGION_SIZE (8192u)
#define IFLASH0_NB_OF_PAGES      (2048u)
#define IFLASH0_NB_OF_LOCK_BITS  (256u)
#define IFLASH1_SIZE             (0x100000u)
#define IFLASH1_PAGE_SIZE        (512u)
#define IFLASH1_LOCK_REGION_SIZE (8192u)
#define IFLASH1_NB_OF_PAGES      (2048u)
#define IFLASH1_NB_OF_LOCK_BITS  (256u)
#define IRAM0_SIZE               (0x60000u)
#define IRAM1_SIZE               (0x8000u)
#define IRAM2_SIZE               (0x4000u)
#define IFLASH_SIZE              (IFLASH0_SIZE+IFLASH1_SIZE)
#define IRAM_SIZE                (IRAM0_SIZE+IRAM1_SIZE+IRAM2_SIZE)

#define IFLASH0_CNC_ADDR        (0x01000000u) /**< Internal Flash (Code - Non Cached) base address */
#if defined IFLASH0_SIZE
#define IFLASH1_CNC_ADDR        (IFLASH0_CNC_ADDR+IFLASH0_SIZE) /**< Internal Flash (Code - Non Cached) base address */
#endif
#define CPKCC_ROM_ADDR          (0x02020000u) /**< CPKCC ROM base address */
#define CPKCC_RAM_ADDR          (0x02031000u) /**< CPKCC RAM base address */
#define QSPI_MEM_CNC_ADDR       (0x04000000u) /**< QSPI Memory (Code - Non Cached) base address */
#define QSPI_AESB_CNC_ADDR      (0x06000000u) /**< QPSI Memory crypted with AESB (Code - Non Cached) base address */
#define IFLASH0_CC_ADDR         (0x11000000u) /**< Internal Flash (Code - Cached) base address */
#if defined IFLASH0_SIZE
#define IFLASH1_CC_ADDR         (IFLASH0_CC_ADDR+IFLASH0_SIZE) /**< Internal Flash (Code - Cached) base address */
#endif
#define QSPI_MEM_CC_ADDR        (0x14000000u) /**< QSPI Memory (Code - Cached) base address */
#define QSPI_AESB_CC_ADDR       (0x16000000u) /**< QPSI Memory crypted with AESB (Code - Cached) base address */
#define DTCM_ADDR               (0x1FFFA000u) /**< Data Tightly Coupled Memory base address */
#define ITCM_ADDR               (0x1FFFC000u) /**< Instruction Tightly Coupled Memory base address */
#define IRAM0_ADDR              (0x20000000u) /**< Internal RAM 0 base address */
#define IRAM1_ADDR              (0x20080000u) /**< Internal RAM 1 base address */
#define IRAM2_ADDR              (0x20088000u) /**< Internal RAM 2 base address */
#define IFLASH_W_ADDR           (0xA1000000u) /**< Internal Flash Write base address */
#define CORTEXM_PRIVATE_PB_ADDR (0xE0000000u) /**< Cortex-M Private Peripheral Bus base address */

/* ************************************************************************** */
/*   MISCELLANEOUS DEFINITIONS FOR PIC32CX2038MTC100 */
/* ************************************************************************** */

#define CHIP_CIDR   (0x2C420EE0UL)
#define CHIP_EXID   (0x00000000UL)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CX2038MTC100 */
/* ************************************************************************** */

/* Device characteristics */
#define CHIP_FREQ_SLCK_RC               (31700UL)
#define CHIP_FREQ_MAINCK_RC_12MHZ       (12110000UL)
#define CHIP_FREQ_CPU_MAX               (200000000UL)
#define CHIP_FREQ_XTAL_32K              (32768UL)

/* Embedded Flash Write Wait State */
#define CHIP_FLASH_WRITE_WAIT_STATE     (6U)

/* Embedded Flash Read Wait State (VDDCORE set at 1.20V / VDDIO set between 2.7V to 3.6V / @ 85°C) */
#define CHIP_FREQ_FWS_0                 (21000000UL)  /**< \brief Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1                 (42000000UL)  /**< \brief Maximum operating frequency when FWS is 1 */
#define CHIP_FREQ_FWS_2                 (63000000UL)  /**< \brief Maximum operating frequency when FWS is 2 */
#define CHIP_FREQ_FWS_3                 (85000000UL)  /**< \brief Maximum operating frequency when FWS is 3 */
#define CHIP_FREQ_FWS_4                 (106000000UL) /**< \brief Maximum operating frequency when FWS is 4 */
#define CHIP_FREQ_FWS_5                 (121000000UL) /**< \brief Maximum operating frequency when FWS is 5 */

#ifdef __cplusplus
}
#endif

/*@}*/

#endif /* _PIC32CX2038MTS100_0_ */
